# Chapter 7 - Data Cleaning and Preparation

# 7.1: Handling Missing Data

In [3]:
import pandas as pd
import numpy as np

string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1.,6.5,3.],[1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4, 1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0  1.438447       NaN       NaN
1 -0.906015       NaN       NaN
2 -0.923463       NaN -0.975966
3 -1.894376       NaN  1.051365
4 -1.252919  0.927641 -0.056485
5 -1.166786  1.533658 -0.317662
6 -0.566674 -0.592412 -0.893317

In [22]:
df.dropna()

          0         1         2
4 -1.252919  0.927641 -0.056485
5 -1.166786  1.533658 -0.317662
6 -0.566674 -0.592412 -0.893317

In [23]:
df.dropna(thresh = 2)

          0         1         2
2 -0.923463       NaN -0.975966
3 -1.894376       NaN  1.051365
4 -1.252919  0.927641 -0.056485
5 -1.166786  1.533658 -0.317662
6 -0.566674 -0.592412 -0.893317

### Filling In Missing Data

In [24]:
df.fillna(0)

          0         1         2
0  1.438447  0.000000  0.000000
1 -0.906015  0.000000  0.000000
2 -0.923463  0.000000 -0.975966
3 -1.894376  0.000000  1.051365
4 -1.252919  0.927641 -0.056485
5 -1.166786  1.533658 -0.317662
6 -0.566674 -0.592412 -0.893317

In [27]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.438447  0.500000  0.000000
1 -0.906015  0.500000  0.000000
2 -0.923463  0.500000 -0.975966
3 -1.894376  0.500000  1.051365
4 -1.252919  0.927641 -0.056485
5 -1.166786  1.533658 -0.317662
6 -0.566674 -0.592412 -0.893317

In [28]:
df.fillna(0, inplace = True)

In [29]:
df

          0         1         2
0  1.438447  0.000000  0.000000
1 -0.906015  0.000000  0.000000
2 -0.923463  0.000000 -0.975966
3 -1.894376  0.000000  1.051365
4 -1.252919  0.927641 -0.056485
5 -1.166786  1.533658 -0.317662
6 -0.566674 -0.592412 -0.893317

In [30]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.296549 -0.869106 -0.540252
1 -1.048291 -0.260607  0.107013
2 -0.670346       NaN -0.280822
3  0.191661       NaN -0.738017
4 -0.852583       NaN       NaN
5  0.290251       NaN       NaN

In [31]:
df.fillna(method = 'ffill')

          0         1         2
0  0.296549 -0.869106 -0.540252
1 -1.048291 -0.260607  0.107013
2 -0.670346 -0.260607 -0.280822
3  0.191661 -0.260607 -0.738017
4 -0.852583 -0.260607 -0.738017
5  0.290251 -0.260607 -0.738017

In [32]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0  0.296549 -0.869106 -0.540252
1 -1.048291 -0.260607  0.107013
2 -0.670346 -0.260607 -0.280822
3  0.191661 -0.260607 -0.738017
4 -0.852583       NaN -0.738017
5  0.290251       NaN -0.738017

In [33]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2: Data Transformation

### Removing Duplicates

In [34]:
data = pd.DataFrame({'k1':['one', 'two'] * 3 + ['two'], 'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [36]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [38]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [39]:
data.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [40]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 'ounces': [4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [41]:
meat_to_animal = {'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow', 'corned beef': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'}

In [42]:
lowercased = data['food'].str.lower()

In [43]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [44]:
data['animal'] = lowercased.map(meat_to_animal)

In [45]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [46]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [47]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [48]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [49]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [50]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [51]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [52]:
data.replace({-999: np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [53]:
data = pd.DataFrame(np.arange(12).reshape((3,4)), index = ['Ohio', 'Colorado', 'New York'], columns = ['one', 'two', 'three', 'four'])
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [54]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [55]:
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [56]:
data.rename(index = {'OHIO':'INDIANA'}, columns = {'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [57]:
data.rename(index = {'OHIO': 'INDIANA'}, inplace = True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [58]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [59]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [60]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [61]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [62]:
pd.cut(ages, [18, 26, 36, 61, 100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [63]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [64]:
data = np.random.rand(20)
pd.cut(data, 4, precision = 2)

[(0.041, 0.24], (0.041, 0.24], (0.041, 0.24], (0.64, 0.84], (0.64, 0.84], ..., (0.64, 0.84], (0.24, 0.44], (0.041, 0.24], (0.24, 0.44], (0.041, 0.24]]
Length: 20
Categories (4, interval[float64]): [(0.041, 0.24] < (0.24, 0.44] < (0.44, 0.64] < (0.64, 0.84]]

In [65]:
data = np.random.randn(1000)

In [66]:
cats = pd.qcut(data, 4)
cats

[(-0.675, -0.0453], (0.625, 4.241], (-0.0453, 0.625], (-0.675, -0.0453], (0.625, 4.241], ..., (-0.0453, 0.625], (-0.0453, 0.625], (-3.274, -0.675], (-0.0453, 0.625], (-0.0453, 0.625]]
Length: 1000
Categories (4, interval[float64]): [(-3.274, -0.675] < (-0.675, -0.0453] < (-0.0453, 0.625] < (0.625, 4.241]]

In [67]:
pd.value_counts(cats)

(-3.274, -0.675]     250
(-0.675, -0.0453]    250
(-0.0453, 0.625]     250
(0.625, 4.241]       250
dtype: int64

In [68]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.281, -0.0453], (-0.0453, 1.256], (-0.0453, 1.256], (-1.281, -0.0453], (-0.0453, 1.256], ..., (-0.0453, 1.256], (-0.0453, 1.256], (-1.281, -0.0453], (-0.0453, 1.256], (-0.0453, 1.256]]
Length: 1000
Categories (4, interval[float64]): [(-3.274, -1.281] < (-1.281, -0.0453] < (-0.0453, 1.256] < (1.256, 4.241]]

### Detecting and Filtering Outliers

In [69]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.010239    -0.029086    -0.009027    -0.011014
std       1.051199     0.960024     1.003682     1.011772
min      -3.104849    -3.134136    -3.661554    -3.237101
25%      -0.713691    -0.650219    -0.665178    -0.694425
50%       0.046956    -0.041187     0.016852     0.001317
75%       0.753205     0.583048     0.622137     0.664077
max       3.013502     2.651615     3.319564     3.236130

In [70]:
col = data[2]

In [71]:
col[np.abs(col) > 3]

98    -3.661554
240    3.319564
287    3.048271
589   -3.254032
Name: 2, dtype: float64

In [72]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
63  -3.104849  0.416891 -0.167091  0.409229
98   1.010480  0.732842 -3.661554 -0.889129
151  3.013502  0.071402 -1.770869 -1.284977
157  0.099245 -0.599191 -0.424162  3.008923
240  1.134296 -1.522880  3.319564 -0.612102
287 -0.631755 -1.137753  3.048271 -1.374735
347 -1.206120 -1.150957 -1.284905  3.236130
456 -0.255286 -3.134136 -2.620904 -1.006901
589  2.415295  0.172268 -3.254032  0.354940
686  2.995825 -2.147629  0.102846 -3.237101
744  0.233155  1.940299  0.029581 -3.112316

In [73]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.010330    -0.028952    -0.008479    -0.010910
std       1.050854     0.959599     0.999536     1.009946
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.713691    -0.650219    -0.665178    -0.694425
50%       0.046956    -0.041187     0.016852     0.001317
75%       0.753205     0.583048     0.622137     0.664077
max       3.000000     2.651615     3.000000     3.000000

In [74]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0 -1.0
1  1.0 -1.0 -1.0  1.0
2 -1.0  1.0  1.0  1.0
3 -1.0 -1.0  1.0  1.0
4 -1.0  1.0  1.0  1.0

### Permutation and Random Sampling

In [75]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5,4)))
sampler = np.random.permutation(5)
sampler

array([4, 1, 0, 3, 2])

In [76]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [78]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11

In [79]:
df.sample(n = 3)

   0  1   2   3
2  8  9  10  11
1  4  5   6   7
0  0  1   2   3

In [80]:
choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n = 10, replace = True)
draws

2   -1
2   -1
1    7
0    5
3    6
3    6
4    4
1    7
3    6
0    5
dtype: int64

### Computing Indicator/Dummy Variables

In [81]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [82]:
dummies = pd.get_dummies(df['key'], prefix = 'key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [ ]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep = '::', header = None, names = mnames)
movies[:10]

all_genres = []
for x in movies.genres:
    all_genres.extend(x.split())
    
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns = genres)

gen = movies.genres[0]
gen.split('|')

dummies.columns.get_indexer(gen.split('|'))

for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1
    
movies_windic = movies.join(dummies.add_prefix('Genre'))
movies_windic = iloc[0]

np.random.seed(12345)
values = np.random.rand(10)
values

bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

# 7.3: String Manipulation

### String Object Methods

In [85]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [87]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [88]:
first, second, third = pieces
first + '::' + second + "::" + third

'a::b::guido'

In [89]:
"::".join(pieces)

'a::b::guido'

In [91]:
'guido' in val

True

In [92]:
val.index(',')

1

In [93]:
val.find(',')

1

In [98]:
val.count(',')

2

In [99]:
val.replace(',', '::')

'a::b:: guido'

In [100]:
val.replace(',', "")

'ab guido'

### Regular Expressions

In [101]:
import re

In [102]:
text = 'foo bar \t baz \t qux'
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [103]:
regex = re.compile('\s+')

In [104]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [105]:
regex.findall(text)

[' ', ' \t ', ' \t ']

In [108]:
text = """Dave dave@google.com Steve steve@google.com Rob rob@google.com Ryan ryan@google.com"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags = re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@google.com', 'rob@google.com', 'ryan@google.com']

In [109]:
m = regex.search(text)
m

In [110]:
text[m.start():m.end()]

'dave@google.com'

In [111]:
print(regex.match(text))

None

In [112]:
print(regex.sub('REDACTED', text))

Dave REDACTED Steve REDACTED Rob REDACTED Ryan REDACTED

### Vectorized String Functions in Pandas

In [115]:
data = {'Dave': 'dave@google.com', 'Steve' : 'steve@gmail.com', 'Rob' : 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [116]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [117]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [118]:
pattern

'[A-Z0-9._%+-]+@[A-Z0-9.-]+\\.[A-Z]{2,4}'

In [119]:
data.str.findall(pattern, flags = re.IGNORECASE)

Dave     [dave@google.com]
Steve    [steve@gmail.com]
Rob        [rob@gmail.com]
Wes                    NaN
dtype: object

In [121]:
data.str[5]

Dave       g
Steve      @
Rob        m
Wes      NaN
dtype: object